dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxAgbt_regdef.h
/** \brief Module Identification Register */
typedef struct _Ifx_AGBT_ID_Bits
{
    Ifx_UReg_32Bit MOD_REV:8;         /**< \brief [7:0] Module Revision Number - MOD_REV (r) */
    Ifx_UReg_32Bit MOD_TYPE:8;        /**< \brief [15:8] Module Type - MOD_TYPE (r) */
    Ifx_UReg_32Bit MOD_NUM:16;        /**< \brief [31:16] Module Number - MOD_NUM (r) */
} Ifx_AGBT_ID_Bits;

/** \brief Interrupt enable register */
typedef struct _Ifx_AGBT_IRE_Bits
{
    Ifx_UReg_32Bit OFWE:1;            /**< \brief [0:0] FIFO overflow enable - OFWE (rw) */
    Ifx_UReg_32Bit WME:1;             /**< \brief [1:1] Watermark interrupt enable - WME (rw) */
    Ifx_UReg_32Bit HWE:1;             /**< \brief [2:2] Hardware error indication interrupt enable - HWE (rw) */
    Ifx_UReg_32Bit FERE:1;            /**< \brief [3:3] Truncated Frame error interrupt enable - FERE (rw) */
    Ifx_UReg_32Bit reserved_4:28;     /**< \brief [31:4] \internal Reserved */
} Ifx_AGBT_IRE_Bits;

/** \brief Interrupt Status Register */
typedef struct _Ifx_AGBT_IRS_Bits
{
    Ifx_UReg_32Bit OFW:1;             /**< \brief [0:0] FIFO overflow - OFW (rwh) */
    Ifx_UReg_32Bit WM:1;              /**< \brief [1:1] FIFO watermark interrupt - WM (rwh) */
    Ifx_UReg_32Bit HW:1;              /**< \brief [2:2] Hardware error indication interrupt - HW (rwh) */
    Ifx_UReg_32Bit FER:1;             /**< \brief [3:3] Truncated Frame - FER (rwh) */
    Ifx_UReg_32Bit reserved_4:28;     /**< \brief [31:4] \internal Reserved */
} Ifx_AGBT_IRS_Bits;

/** \brief Kernel Reset Register 0 */
typedef struct _Ifx_AGBT_KRST0_Bits
{
    Ifx_UReg_32Bit RST:1;             /**< \brief [0:0] Kernel Reset - RST (rwh) */
    Ifx_UReg_32Bit RSTSTAT:1;         /**< \brief [1:1] Kernel Reset Status - RSTSTAT (rh) */
    Ifx_UReg_32Bit reserved_2:30;     /**< \brief [31:2] \internal Reserved */
} Ifx_AGBT_KRST0_Bits;

/** \brief Kernel Reset Register 1 */
typedef struct _Ifx_AGBT_KRST1_Bits
{
    Ifx_UReg_32Bit RST:1;             /**< \brief [0:0] Kernel Reset - RST (rwh) */
    Ifx_UReg_32Bit reserved_1:31;     /**< \brief [31:1] \internal Reserved */
} Ifx_AGBT_KRST1_Bits;

/** \brief Kernel Reset Status Clear Register */
typedef struct _Ifx_AGBT_KRSTCLR_Bits
{
    Ifx_UReg_32Bit CLR:1;             /**< \brief [0:0] Kernel Reset Status Clear - CLR (w) */
    Ifx_UReg_32Bit reserved_1:31;     /**< \brief [31:1] \internal Reserved */
} Ifx_AGBT_KRSTCLR_Bits;

/** \brief PLL analog part, Control Register 1 */
typedef struct _Ifx_AGBT_PACR1_Bits
{
    Ifx_UReg_32Bit reserved_0:8;      /**< \brief [7:0] \internal Reserved */
    Ifx_UReg_32Bit RBUF2G5:4;         /**< \brief [11:8] RBUF2G5 - RBUF2G5 (rw) */
    Ifx_UReg_32Bit IBUF2G5:2;         /**< \brief [13:12] IBUF2G5 - IBUF2G5 (rw) */
    Ifx_UReg_32Bit IBUFDCO:2;         /**< \brief [15:14] IBUFDCO - IBUFDCO (rw) */
    Ifx_UReg_32Bit IDIV2F5G:2;        /**< \brief [17:16] IDIV2F5G - IDIV2F5G (rw) */
    Ifx_UReg_32Bit IDIV4F5G:2;        /**< \brief [19:18] IDIV4F5G - IDIV4F5G (rw) */
    Ifx_UReg_32Bit IDCOLDO:2;         /**< \brief [21:20] IDCOLDO - IDCOLDO (rw) */
    Ifx_UReg_32Bit IPICOND:2;         /**< \brief [23:22] IPICOND - IPICOND (rw) */
    Ifx_UReg_32Bit IPI:2;             /**< \brief [25:24] IPI - IPI (rw) */
    Ifx_UReg_32Bit BETALKD:4;         /**< \brief [29:26] BETALKD - BETALKD (rw) */
    Ifx_UReg_32Bit reserved_30:2;     /**< \brief [31:30] \internal Reserved */
} Ifx_AGBT_PACR1_Bits;

/** \brief PLL analog part, Control Register 2 */
typedef struct _Ifx_AGBT_PACR2_Bits
{
    Ifx_UReg_32Bit RDIV2F5G:4;        /**< \brief [3:0] RDIV2F5G - RDIV2F5G (rw) */
    Ifx_UReg_32Bit RDIV4F5G:4;        /**< \brief [7:4] RDIV4F5G - RDIV4F5G (rw) */
    Ifx_UReg_32Bit DCLKDEN:1;         /**< \brief [8:8] DCLKDEN - DCLKDEN (rw) */
    Ifx_UReg_32Bit DCLKIEN:1;         /**< \brief [9:9] DCLKIEN - DCLKIEN (rw) */
    Ifx_UReg_32Bit FRACMEN:1;         /**< \brief [10:10] FRACMEN - FRACMEN (rw) */
    Ifx_UReg_32Bit reserved_11:1;     /**< \brief [11:11] \internal Reserved */
    Ifx_UReg_32Bit LDOVREFS:3;        /**< \brief [14:12] LDOVREFS - LDOVREFS (rw) */
    Ifx_UReg_32Bit reserved_15:1;     /**< \brief [15:15] \internal Reserved */
    Ifx_UReg_32Bit MMDSEL:7;          /**< \brief [22:16] MMDSEL - MMDSEL (rw) */
    Ifx_UReg_32Bit reserved_23:1;     /**< \brief [23:23] \internal Reserved */
    Ifx_UReg_32Bit PICAPSEL:3;        /**< \brief [26:24] PICAPSEL - PICAPSEL (rw) */
    Ifx_UReg_32Bit reserved_27:5;     /**< \brief [31:27] \internal Reserved */
} Ifx_AGBT_PACR2_Bits;

/** \brief PLL digital part, Control Register 1 */
typedef struct _Ifx_AGBT_PDCR1_Bits
{
    Ifx_UReg_32Bit ALPHAP:4;          /**< \brief [3:0] ALPHAP - ALPHAP (rw) */
    Ifx_UReg_32Bit GAMMAP:4;          /**< \brief [7:4] GAMMAP - GAMMAP (rw) */
    Ifx_UReg_32Bit reserved_8:7;      /**< \brief [14:8] \internal Reserved */
    Ifx_UReg_32Bit ACCFACQ:1;         /**< \brief [15:15] ACCFACQ - ACCFACQ (rw) */
    Ifx_UReg_32Bit LFWACCM:4;         /**< \brief [19:16] LFWACCM - LFWACCM (rw) */
    Ifx_UReg_32Bit UDCW:4;            /**< \brief [23:20] UDCW - UDCW (rw) */
    Ifx_UReg_32Bit ENBYCAL:1;         /**< \brief [24:24] ENBYCAL - ENBYCAL (rw) */
    Ifx_UReg_32Bit reserved_25:7;     /**< \brief [31:25] \internal Reserved */
} Ifx_AGBT_PDCR1_Bits;

/** \brief PLL digital part, status Register 1 */
typedef struct _Ifx_AGBT_PDST1_Bits
{
    Ifx_UReg_32Bit PDST12:1;          /**< \brief [0:0] PDST12 - PDST12 (r) */
    Ifx_UReg_32Bit PDST13:1;          /**< \brief [1:1] PDST13 - PDST13 (r) */
    Ifx_UReg_32Bit reserved_2:30;     /**< \brief [31:2] \internal Reserved */
} Ifx_AGBT_PDST1_Bits;

/** \brief Physical layer Control Register 1 */
typedef struct _Ifx_AGBT_PYCR1_Bits
{
    Ifx_UReg_32Bit reserved_0:2;      /**< \brief [1:0] \internal Reserved */
    Ifx_UReg_32Bit IPLL25U:2;         /**< \brief [3:2] IPLL25U - IPLL25U (rw) */
    Ifx_UReg_32Bit reserved_4:12;     /**< \brief [15:4] \internal Reserved */
    Ifx_UReg_32Bit ITXOCD25:2;        /**< \brief [17:16] ITXOCD25 - ITXOCD25 (rw) */
    Ifx_UReg_32Bit ITXOCD50:2;        /**< \brief [19:18] ITXOCD50 - ITXOCD50 (rw) */
    Ifx_UReg_32Bit ITXOCDVR:2;        /**< \brief [21:20] ITXOCDVR - ITXOCDVR (rw) */
    Ifx_UReg_32Bit reserved_22:10;    /**< \brief [31:22] \internal Reserved */
} Ifx_AGBT_PYCR1_Bits;

