dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxAgbt_regdef.h
/** \brief PLL analog part, Control Register 1   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AGBT_PACR1_Bits B;            /**< \brief Bitfield access */
} Ifx_AGBT_PACR1;

/** \brief PLL analog part, Control Register 2   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AGBT_PACR2_Bits B;            /**< \brief Bitfield access */
} Ifx_AGBT_PACR2;

/** \brief PLL digital part, Control Register 1   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AGBT_PDCR1_Bits B;            /**< \brief Bitfield access */
} Ifx_AGBT_PDCR1;

/** \brief PLL digital part, status Register 1   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AGBT_PDST1_Bits B;            /**< \brief Bitfield access */
} Ifx_AGBT_PDST1;

/** \brief Physical layer Control Register 1   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AGBT_PYCR1_Bits B;            /**< \brief Bitfield access */
} Ifx_AGBT_PYCR1;

/** \brief Physical layer Control Register 2   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AGBT_PYCR2_Bits B;            /**< \brief Bitfield access */
} Ifx_AGBT_PYCR2;

/** \brief Trace Auto Channel UP   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AGBT_TACU_Bits B;             /**< \brief Bitfield access */
} Ifx_AGBT_TACU;

/** \brief Trace Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AGBT_TCR_Bits B;              /**< \brief Bitfield access */
} Ifx_AGBT_TCR;

/** \brief Trace Status Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_AGBT_TSR_Bits B;              /**< \brief Bitfield access */
} Ifx_AGBT_TSR;

/** \}  */

/******************************************************************************/
/** \addtogroup IfxSfr_Agbt_Registers_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \brief AGBT object */
typedef volatile struct _Ifx_AGBT
{
       Ifx_AGBT_CLC                        CLC;                    /**< \brief 0, Clock Control Register*/
       Ifx_UReg_8Bit                       reserved_4[4];          /**< \brief 4, \internal Reserved */
       Ifx_AGBT_ID                         ID;                     /**< \brief 8, Module Identification Register*/
       Ifx_UReg_8Bit                       reserved_C[4];          /**< \brief C, \internal Reserved */
       Ifx_AGBT_TCR                        TCR;                    /**< \brief 10, Trace Control Register*/
       Ifx_AGBT_TSR                        TSR;                    /**< \brief 14, Trace Status Register*/
       Ifx_AGBT_FCTRL                      FCTRL;                  /**< \brief 18, FIFO Control Register*/
       Ifx_AGBT_TACU                       TACU;                   /**< \brief 1C, Trace Auto Channel UP*/
       Ifx_AGBT_FBFLV                      FBFLV;                  /**< \brief 20, FIFO Block Fill Level*/
       Ifx_AGBT_IRS                        IRS;                    /**< \brief 24, Interrupt Status Register*/
       Ifx_AGBT_IRE                        IRE;                    /**< \brief 28, Interrupt enable register*/
       Ifx_UReg_8Bit                       reserved_2C[4];         /**< \brief 2C, \internal Reserved */
       Ifx_AGBT_PYCR1                      PYCR1;                  /**< \brief 30, Physical layer Control Register 1*/
       Ifx_AGBT_PYCR2                      PYCR2;                  /**< \brief 34, Physical layer Control Register 2*/
       Ifx_AGBT_PACR1                      PACR1;                  /**< \brief 38, PLL analog part, Control Register 1*/
       Ifx_AGBT_PACR2                      PACR2;                  /**< \brief 3C, PLL analog part, Control Register 2*/
       Ifx_AGBT_PDCR1                      PDCR1;                  /**< \brief 40, PLL digital part, Control Register 1*/
       Ifx_UReg_8Bit                       reserved_44[8];         /**< \brief 44, \internal Reserved */
       Ifx_AGBT_PDST1                      PDST1;                  /**< \brief 4C, PLL digital part, status Register 1*/
       Ifx_UReg_8Bit                       reserved_50[156];       /**< \brief 50, \internal Reserved */
       Ifx_AGBT_KRSTCLR                    KRSTCLR;                /**< \brief EC, Kernel Reset Status Clear Register*/
       Ifx_AGBT_KRST1                      KRST1;                  /**< \brief F0, Kernel Reset Register 1*/
       Ifx_AGBT_KRST0                      KRST0;                  /**< \brief F4, Kernel Reset Register 0*/
       Ifx_AGBT_ACCEN1                     ACCEN1;                 /**< \brief F8, Access Enable Register 1*/
       Ifx_AGBT_ACCEN0                     ACCEN0;                 /**< \brief FC, Access Enable Register 0*/
} Ifx_AGBT;

/** \}  */
/******************************************************************************/
/** \}  */


/******************************************************************************/

/******************************************************************************/

#endif /* IFXAGBT_REGDEF_H */
